; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-7)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 9470)
	(= (fuel plane1) 3189)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 14)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 8)
	(at plane2 city4)
	(= (capacity plane2) 12367)
	(= (fuel plane2) 3164)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 13)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 6)
	(at plane3 city1)
	(= (capacity plane3) 5750)
	(= (fuel plane3) 772)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 7)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 6)
	(at plane4 city0)
	(= (capacity plane4) 2975)
	(= (fuel plane4) 421)
	(= (slow-burn plane4) 1)
	(= (fast-burn plane4) 2)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 1)
	(at person1 city1)
	(at person2 city1)
	(at person3 city2)
	(at person4 city3)
	(at person5 city4)
	(at person6 city1)
	(at person7 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 646)
	(= (distance city0 city2) 556)
	(= (distance city0 city3) 694)
	(= (distance city0 city4) 633)
	(= (distance city1 city0) 646)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 882)
	(= (distance city1 city3) 710)
	(= (distance city1 city4) 746)
	(= (distance city2 city0) 556)
	(= (distance city2 city1) 882)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 639)
	(= (distance city2 city4) 802)
	(= (distance city3 city0) 694)
	(= (distance city3 city1) 710)
	(= (distance city3 city2) 639)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 828)
	(= (distance city4 city0) 633)
	(= (distance city4 city1) 746)
	(= (distance city4 city2) 802)
	(= (distance city4 city3) 828)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city0)
	(at person2 city0)
	(at person3 city2)
	(at person4 city2)
	(at person5 city4)
	(at person6 city4)
	(at person7 city0)
	))

(:metric minimize (+ (* 2 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (board person1 plane1 city1)
   deleted: (at person1 city1)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 7
2. (board person2 plane1 city1)
   deleted: (at person2 city1)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 7
3. (board person6 plane1 city1)
   deleted: (at person6 city1)
   added: (in person6 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 2 of 7
4. (fly plane1 city1 city3)
   deleted: (at plane1 city1)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 0 to 2840, (fuel plane1) from 3189 to 349
   goals met: 2 of 7
5. (board person4 plane1 city3)
   deleted: (at person4 city3)
   added: (in person4 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 2 of 7
6. (board person7 plane1 city3)
   deleted: (at person7 city3)
   added: (in person7 plane1)
   changed: (onboard plane1) from 4 to 5
   goals met: 2 of 7
7. (refuel plane1 city3)
   changed: (fuel plane1) from 349 to 9470
   goals met: 2 of 7
8. (fly plane1 city3 city0)
   deleted: (at plane1 city3)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 2840 to 5616, (fuel plane1) from 9470 to 6694
   goals met: 2 of 7
9. (debark person1 plane1 city0)
   deleted: (in person1 plane1)
   added: (at person1 city0)
   changed: (onboard plane1) from 5 to 4
   goals met: 3 of 7
10. (debark person2 plane1 city0)
   deleted: (in person2 plane1)
   added: (at person2 city0)
   changed: (onboard plane1) from 4 to 3
   goals met: 4 of 7
11. (debark person7 plane1 city0)
   deleted: (in person7 plane1)
   added: (at person7 city0)
   changed: (onboard plane1) from 3 to 2
   goals met: 5 of 7
12. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 5616 to 7840, (fuel plane1) from 6694 to 4470
   goals met: 5 of 7
13. (debark person4 plane1 city2)
   deleted: (in person4 plane1)
   added: (at person4 city2)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 7
14. (fly plane1 city2 city4)
   deleted: (at plane1 city2)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 7840 to 11048, (fuel plane1) from 4470 to 1262
   goals met: 6 of 7
15. (debark person6 plane1 city4)
   deleted: (in person6 plane1)
   added: (at person6 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 7
